<template>
  <div>
    <img class="mb-5" src="@/assets/logo.svg" alt="Nethernite game logo" />
    <p>Задание должно быть выполнено с использованием:</p>
    <ol>
      <li>es6</li>
      <li>vue/vuex</li>
      <li>scss</li>
    </ol>
    <p>Приветствуется:</p>
    <ol>
      <li>умение работать с git, npm, photoshop, figma</li>
      <li>понимание принципов DRY, KISS</li>
    </ol>
    <p>
      Необходимо сделать SPA, на котором будет предоставляться доступ к
      <code>https://jsdelivr.com</code> по средствам API
      <code>https://github.com/jsdelivr/data.jsdelivr.com</code>
    </p>
    <p>Оформить внешний вид при помощи Vuetify или Bootstrap.</p>
    <p>Приложение:</p>
    <ol>
      <li>
        Главная страница:
        <ul>
          <li>Сверху текстовое поле для поиска.</li>
          <li>В таблице результат - список пакетов.</li>
          <li>Каждая запись содержит базовую информацию о пакете.</li>
          <li>Результат поиска разбит на страницы по 10 записей.</li>
        </ul>
      </li>
      <li>
        По клику на запись в таблице должно открываться модальное окно
        содержащее расширенную информацию о пакете.
      </li>
      <li>
        Футер:
        <ul>
          <li>Информация об авторе (ссылка на гит, имя, можно фото).</li>
        </ul>
      </li>
    </ol>
    <p>Мы оценим если:</p>
    <ol>
      <li>Приложение будет работать локально после npm i && npm run start.</li>
      <li>Приложение будет кроссбраузерным и адаптивным.</li>
      <li>Будет качественная работа с API</li>
    </ol>
  </div>
</template>
